/////////////////////////////////////////////////////////////////////////////
//
// File: diagram_default_widget_entry.cpp
//
// Created by code1009.
// Created on Dec-17th, 2014.
//
/////////////////////////////////////////////////////////////////////////////
//===========================================================================





/////////////////////////////////////////////////////////////////////////////
//
// Headers
//
/////////////////////////////////////////////////////////////////////////////
//===========================================================================
#include "stdafx.h"
#include "../header.hpp"





/////////////////////////////////////////////////////////////////////////////
//===========================================================================
namespace gw
{
namespace dgrm
{



/////////////////////////////////////////////////////////////////////////////
//===========================================================================
void add_default_widget_entry(widget_entry_collection* wec)
{
	wec->get_container().push_back( create_widget_entry< diagram        , diagram_event_handler        , diagram_json_iostream         >("다이어그램") );
	wec->get_container().push_back( create_widget_entry< rectangle_shape, rectangle_shape_event_handler, rectangle_shape_json_iostream >("사각형"    ) );
	wec->get_container().push_back( create_widget_entry< straight_line  , straight_line_event_handler  , straight_line_json_iostream   >("직선"      ) );


}



/////////////////////////////////////////////////////////////////////////////
//===========================================================================
}
}
